SOLVER_and_TEST_CASE/vortexMergerUp/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       130560;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          131072;
        startFace       131584;
    }
)

// ************************************************************************* //
