SOLVER_and_TEST_CASE/vortexMergerUp/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
65536
(
(0.000675466 -0.00067547 0)
(0.00202633 -0.000675398 0)
(0.00337704 -0.000675302 0)
(0.00472753 -0.000675167 0)
(0.0060777 -0.000674986 0)
(0.00742748 -0.000674748 0)
(0.00877672 -0.000674481 0)
(0.0101254 -0.000674165 0)
...
)
;

boundaryField
{
    fixedWalls
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
